#### Terraform Initialization ⚙️ - `success`
#### Terraform Validate 📃 - `success`
#### Terraform Plan 📖 - `success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/AIGISUK/gh-actions-terraform-digitalocean-doks/runs/run-VvL6kAS8c9CUXJNE

Waiting for the plan to start...

Terraform v1.1.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.doks.digitalocean_kubernetes_cluster.doks will be created
  + resource "digitalocean_kubernetes_cluster" "doks" {
      + auto_upgrade   = false
      + cluster_subnet = (known after apply)
      + created_at     = (known after apply)
      + endpoint       = (known after apply)
      + ha             = false
      + id             = (known after apply)
      + ipv4_address   = (known after apply)
      + kube_config    = (sensitive value)
      + name           = "dev-cluster"
      + region         = "fra1"
      + service_subnet = (known after apply)
      + status         = (known after apply)
      + surge_upgrade  = true
      + tags           = [
          + "kubernetes",
        ]
      + updated_at     = (known after apply)
      + urn            = (known after apply)
      + version        = "1.21.5-do.0"
      + vpc_uuid       = "41567c0a-8795-471d-8834-82290be25fec"

      + maintenance_policy {
          + day        = "sunday"
          + duration   = (known after apply)
          + start_time = "01:00"
        }

      + node_pool {
          + actual_node_count = (known after apply)
          + auto_scale        = false
          + id                = (known after apply)
          + labels            = {
              + "service" = "kubernetes"
            }
          + max_nodes         = 5
          + min_nodes         = 1
          + name              = "dev-cluster-core"
          + node_count        = 3
          + nodes             = (known after apply)
          + size              = "s-2vcpu-2gb"
          + tags              = [
              + "kubernetes",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ca_cert        = (sensitive value)
  + cluster_id     = (known after apply)
  + cluster_subnet = (known after apply)
  + endpoint       = (known after apply)
  + service_subnet = (known after apply)
```
</details>
*Pusher: @colinwilson, Action: `pull_request`, Workdir: `examples/github_actions`, Workflow: `Terraform GitHub Actions`*